# Core shell tools
brew "direnv"
brew "mise"
brew "starship"
brew "zsh"

# Git
brew "diff-so-fancy"
brew "gh"
brew "git"

# Terminal emulator
cask "ghostty"

# Development tools
brew "jq"
brew "tree"
brew "1password-cli"

# Zsh plugins
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts (for starship themes with nerd font icons)
cask "font-fira-code-nerd-font"
